Repository: krodyrobi/pressignio
Catalog: mysite/blog/locale/*/LC_MESSAGES/django.po
Languages: de, fr

source: Pressignio account confirmation:
de: Pressignio Konto Nachweis:
fr: Compte Pressignio confirmation:

source: Illegal characters.
de: Verbotene Zeichen.
fr: Caractères illégaux.

source: Username already in use, choose another username.
de: Username ist schon verwendet, such einen anderen aus.
fr: Nom d'utilisateur déjà utilisé, choisir un autre nom.

source: Email already in use.
de: Email war wieder geschickt
fr: Email déjà utilisé.

source: This name has already been taken, please choose another.
de: Dieser Name ist schon verwendet, bitte such einen anderen aus.
fr: Ce nom a déjà été prise, veuillez en choisir un autre.

source: Passwords must match!
de: Passwörter müssen übereinstimmen!
fr: Les mots de passe doivent correspondre!

source: Email not found or user already active!
de: Email nicht gefunden oder Konto is schon aktiv!
fr: Envoyer introuvable ou utilisateur déjà actif!

source: No account with the email or username provided.
de: Kein Konto mit dem Email or Username gefunden.
fr: Pas de compte avec l'email ou le nom d'utilisateur fourni.

source: Wrong password
de: Schlechten Username oder Passwort.
fr: Mot de passe incorrect

source: Account has been created, to complete the registration process go to the link sent to your email adress (%s)
de: Dein Konto war geschafft, um die Registration zu beenden folg den Link in deinen Email Inbox (%s)
fr: Compte a été créé, afin de compléter le processus d'inscription, allez au lien envoyé à votre adresse e-mail ( %s )

source: Email resent.
de: Email war wieder geschickt
fr: Envoyer renvoyé.

source: Wrong activation link. Try again.
de: Schlechtem Aktivation Link. Versuch es erneut.
fr: Lien d'activation tort. Essayez à nouveau.

source: Account succesfully activated.
de: Konto war erfolgreigh aktiviert.
fr: Compte succès activée.

source: Password recovery email sent.
de: Passwort Wiederherstellung Email geschickt.
fr: e-mail de récupération de mot de passe envoyé.

source: Wrong recovery link. Try again!
de: Schlechtem Wiederherstellung Link. Versuch es erneut!
fr: Lien de récupération mal. Essayez à nouveau!

source: Check your email for the reset link. (%s)
de: Such in deinem Email für der Wiederherstellung Link. (%s)
fr: Vérifiez vos courriels pour le lien de réinitialisation. ( %s )

source: Account not activated yet, check your email for the validation link. <a href=" /blog/resend/">Not there? Resend it here!</a>
de: Konto nicht gerade aktiviert, such in deinem Email für der Wiederherstellung Link. <a href="/blog/resend/"> Nicht dort? Schick es wieder hier!</a>
fr: Compte pas encore activé, vérifiez votre email le lien de validation. <a href="/blog/resend/"> pas là? Renvoyez-le ici! </a>

source: Wrong username or password.
de: Schlechten Username oder Passwort.
fr: Nom d'utilisateur ou mot de passe erroné.

source: Your edits have been saved successfully.
de: Deine Beänderung sind erfolgreich gespeichert.
fr: Vos modifications ont été sauvegardé avec succès.
